# Working with GroupBy

Hi Guys, Welcome to [Be.Analyst](https://youtube.com/@Be.Analyst) üòÄ
</br>
In this notebook, I'm going to show how to work with the groupby method in Pandas.
</br>
Happy Learning üê±‚Äçüèç

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame({"key":list("ABC")*2,
                 "data1":range(6),
                 "data2":np.arange(5,11)})

In [3]:
df

  key  data1  data2
0   A      0      5
1   B      1      6
2   C      2      7
3   A      3      8
4   B      4      9
5   C      5     10

In [4]:
group=df.groupby("key")

In [5]:
group.aggregate(["min",np.median,"max"])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     5    6.5   8
B       1    2.5   4     6    7.5   9
C       2    3.5   5     7    8.5  10

In [6]:
group.agg({"data1":"min","data2":"max"})

     data1  data2
key
A        0      8
B        1      9
C        2     10

In [7]:
def f(x):
    return x.max()-x.min()

In [8]:
group.agg(f)

     data1  data2
key
A        3      3
B        3      3
C        3      3

## Applying more than one function

In [9]:
data=pd.DataFrame({"letter":list("ABC")*4,
                   "num":["one","two"]*6,
                   "d1":np.random.randn(12),
                   "d2":np.arange(10,33,2)})

In [10]:
data

   letter  num        d1  d2
0       A  one -1.706149  10
1       B  two  0.351626  12
2       C  one -0.286643  14
3       A  two  1.170777  16
4       B  one  1.043207  18
5       C  two  1.602591  20
6       A  one  0.199512  22
7       B  two  0.786752  24
8       C  one  0.897336  26
9       A  two  0.144917  28
10      B  one  1.970838  30
11      C  two  0.133693  32

In [11]:
group=data.groupby(["letter","num"])

In [12]:
group_d1=group["d1"]

In [13]:
group_d1.agg("mean")

letter  num
A       one   -0.753319
        two    0.657847
B       one    1.507022
        two    0.569189
C       one    0.305347
        two    0.868142
Name: d1, dtype: float64

In [14]:
group_d1.agg(["mean","std",f])

                mean       std         f
letter num
A      one -0.753319  1.347506  1.905661
       two  0.657847  0.725393  1.025861
B      one  1.507022  0.655934  0.927630
       two  0.569189  0.307680  0.435126
C      one  0.305347  0.837199  1.183979
       two  0.868142  1.038668  1.468898

In [15]:
group_d1.agg([("f_mean","mean"),
              ("f_std",np.std)])

              f_mean     f_std
letter num
A      one -0.753319  1.347506
       two  0.657847  0.725393
B      one  1.507022  0.655934
       two  0.569189  0.307680
C      one  0.305347  0.837199
       two  0.868142  1.038668

In [16]:
group.agg({"d1":["count","max","mean"],
           "d2":"sum"})

              d1                      d2
           count       max      mean sum
letter num
A      one     2  0.199512 -0.753319  32
       two     2  1.170777  0.657847  44
B      one     2  1.970838  1.507022  48
       two     2  0.786752  0.569189  36
C      one     2  0.897336  0.305347  40
       two     2  1.602591  0.868142  52

In [17]:
data.groupby(["letter","num"],
             as_index=False).mean()

  letter  num        d1    d2
0      A  one -0.753319  16.0
1      A  two  0.657847  22.0
2      B  one  1.507022  24.0
3      B  two  0.569189  18.0
4      C  one  0.305347  20.0
5      C  two  0.868142  26.0

## Split-Apply-Combine

In [18]:
data

   letter  num        d1  d2
0       A  one -1.706149  10
1       B  two  0.351626  12
2       C  one -0.286643  14
3       A  two  1.170777  16
4       B  one  1.043207  18
5       C  two  1.602591  20
6       A  one  0.199512  22
7       B  two  0.786752  24
8       C  one  0.897336  26
9       A  two  0.144917  28
10      B  one  1.970838  30
11      C  two  0.133693  32

In [19]:
group=data.groupby("letter")

In [20]:
group["d2"].apply(lambda x:x.describe())

letter
A       count     4.000000
        mean     19.000000
        std       7.745967
        min      10.000000
        25%      14.500000
        50%      19.000000
        75%      23.500000
        max      28.000000
B       count     4.000000
        mean     21.000000
        std       7.745967
        min      12.000000
        25%      16.500000
        50%      21.000000
        75%      25.500000
        max      30.000000
C       count     4.000000
        mean     23.000000
        std       7.745967
        min      14.000000
        25%      18.500000
        50%      23.000000
        75%      27.500000
        max      32.000000
Name: d2, dtype: float64

In [21]:
math=pd.DataFrame({"Class":list("AB")*3,
                   "Stu":["Kim","Sam",
                          "Tim","Tom","John","Kate"],
                   "Score":[60,70,np.nan,
                            55,np.nan,80]})
math

  Class   Stu  Score
0     A   Kim   60.0
1     B   Sam   70.0
2     A   Tim    NaN
3     B   Tom   55.0
4     A  John    NaN
5     B  Kate   80.0

In [22]:
group=math.groupby("Class")

In [23]:
group.mean()

C:\Users\durge\AppData\Local\Temp\ipykernel_21496\3928442431.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  group.mean()

           Score
Class
A      60.000000
B      68.333333

In [24]:
func=lambda f:f.fillna(f.mean())

In [25]:
group.apply(func)

C:\Users\durge\AppData\Local\Temp\ipykernel_21496\2055239539.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  func=lambda f:f.fillna(f.mean())
C:\Users\durge\AppData\Local\Temp\ipykernel_21496\2055239539.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  func=lambda f:f.fillna(f.mean())
C:\Users\durge\AppData\Local\Temp\ipykernel_21496\3149468892.py:1: FutureWarning: Not prepending group keys to the result index of transform-like apply. In the future, the group keys will be included in the index, regardless of whether the applied function returns a like-indexed object.
To preserve the previous behavior, use

	>>> .groupby(..., group_keys=False)

To adopt the future behavior and silence this warning, use

	>>> .groupby(..., group_keys=True)
  group.apply(func)

  Class   Stu  Score
0     A   Kim   60.0
1     B   Sam   70.0
2     A   Tim   60.0
3     B   Tom   55.0
4     A  John   60.0
5     B  Kate   80.0

In [26]:
value={"A":100,"B":50}

In [27]:
func1=lambda f:f.fillna(value[f.name])

In [28]:
group.apply(func1)

C:\Users\durge\AppData\Local\Temp\ipykernel_21496\1325833793.py:1: FutureWarning: Not prepending group keys to the result index of transform-like apply. In the future, the group keys will be included in the index, regardless of whether the applied function returns a like-indexed object.
To preserve the previous behavior, use

	>>> .groupby(..., group_keys=False)

To adopt the future behavior and silence this warning, use

	>>> .groupby(..., group_keys=True)
  group.apply(func1)

  Class   Stu  Score
0     A   Kim   60.0
1     B   Sam   70.0
2     A   Tim  100.0
3     B   Tom   55.0
4     A  John  100.0
5     B  Kate   80.0

Don't forget to follow us on [YouTube](http://youtube.com/@Be.Analyst) | [Medium](https://medium.com/@durgeshanalyst) | [Twitter](https://twitter.com/DurgeshBR?t=2LDCN4pHkZOYIo3rMXvKnw&s=09) | [GitHub](http://github.com/durgeshanalyst) | [Linkedin](https://www.linkedin.com/in/durgeshanalyst/) | [Kaggle](https://www.kaggle.com/durgeshanalyst) üòé